public class Main {// объявили класс

    public static void main(String[] args) { //сигнатура метрода Main, обхявление метода Main
        // объявление переменной
        int count;
        // первое присваивание значения = инициализация переменной
        count = 0;
        // объявляем переменную и инициализируем ее нулем
        int count2 = 0;
        // присвоим новое значение переменной / обновим значение переменной
        count2 = 2;
        System.out.println();// вызов метода с конкретным значением параметр/ аргументом

    }

    public static int square(int x) { // сигнатура метода
        // тело метода
        return x * x;
    }
}
